## Intermediate SQL

In [2]:
import cx_Oracle
import pandas as pd

def print_all():
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute("SELECT * FROM FILMS")
    return pd.DataFrame(cursor)

def run_statement(sql):
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute(sql)
    for row in cursor:
        display(row)
df = print_all()
display(df.head())

,0,1,2,3,4,5,6,7,8
0,389,Sheena,1984.0,UK,117.0,English,PG,NaN,25000000.0
1,390,Splash,1984.0,USA,111.0,English,PG,69800000.0,8000000.0
2,391,Star Trek III: The Search for Spock,1984.0,USA,105.0,English,PG,76400000.0,17000000.0
3,392,The Bounty,1984.0,UK,132.0,English,PG,8600000.0,25000000.0
4,393,The Cotton Club,1984.0,USA,123.0,English,R,25900000.0,58000000.0

### Selecting Data

#### SQL style

#### SQL formatting
* Formatting is not required
* But lack of formatting can cause issues

In [1]:
# select title, release_year, country from films limit 3

#### Best practices

In [ ]:
# SELECT title, release_year, country
# FROM films
# LIMIT 3;

* Capitalize words
* Add new lines

#### Style guides

In [ ]:
# SELECT
#     title,
#     release_year,
#     country
# FROM films
# LIMIT 3;

Write clear and readable code

#### Semicolon

In [ ]:
# SELECT title, release_year, country
# FROM films
# LIMIT 3;

* Best practice
* Easier to translate between SQL flavors
* Indicates the end of a query

#### Dealing with non-standard field names
* `release year` instead of `release_year`
* Put non-standard field names in double-quotes

In [ ]:
# SELECT title, "release_year", country
# FROM films
# LIMIT 3;

#### Why do we format?
* Easier collaboration
* Clear and readable
* Looks professional
* Easier to understand
* Easier to debug